stepping.yml
version: 1.0

# 100 requests
execution:
  # name convention as follows: start with method e.g. get, post, follow with path tested in snake case
  # for simplicity, params and slashes reduced alike
  - scenario: post_api_testing_reset_test_plan
    concurrency: 1
    iterations: 1
    start: 0

  - scenario: get_api_inventory
    concurrency: 5
    iterations: 20

  - scenario: get_api_product_detailed_categoryid_1
    concurrency: 5
    iterations: 20

  - scenario: get_api_warehouse
    concurrency: 5
    iterations: 20

  - scenario: get_api_warehouse_1
    concurrency: 5
    iterations: 20

  - scenario: get_api_category
    concurrency: 5
    iterations: 20

  - scenario: get_api_category_1
    concurrency: 5
    iterations: 20

  - scenario: get_api_inventory_category_1
    concurrency: 5
    iterations: 20

  - scenario: post_api_category
    start: 25

  - scenario: put_api_category
    start: 35

  - scenario: delete_api_category
    start: 45

  - scenario: post_api_testing_reset_test_plan
    start: 55

scenarios:
  get_api_inventory:
    script: get-api-inventory-test-plan.jmx

  get_api_warehouse:
    script: get-api-warehouse-test-plan.jmx

  get_api_warehouse_1:
    script: get-api-warehouse-1-test-plan.jmx

  get_api_category:
    script: get-api-category-test-plan.jmx

  get_api_category_1:
    script: get-api-category-1-test-plan.jmx

  get_api_product_detailed_categoryid_1:
    script: get-api-product-detailed-categoryid-1-test-plan.jmx

  get_api_inventory_category_1:
    script: get-api-inventory-category-1-test-plan.jmx

  post_api_testing_reset:
    script: post-api-testing-reset-test-plan.jmx

  post_api_category:
    script: post-api-category-test-plan.jmx

  put_api_category:
    script: put-api-category-test-plan.jmx

  delete_api_category:
    script: delete-api-category-test-plan.jmx

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml