stepping.yml
version: 1.0

execution:
  # name convention as follows: start with method e.g. get, post, follow with path tested in snake case
  # for simplicity, params and slashes reduced alike
  - scenario: post_put_delete_api_warehouse_category_inventory_product

  - scenario: get_api_inventory
    concurrency: 5
    iterations: 20

  # 100 requests
  - scenario: get_api_product_detailed_categoryid_1
    concurrency: 5
    iterations: 20

  - scenario: get_api_warehouse
    concurrency: 5
    iterations: 20

  - scenario: get_api_warehouse_1
    concurrency: 5
    iterations: 20

  - scenario: get_api_category
    concurrency: 5
    iterations: 20

  - scenario: get_api_category_1
    concurrency: 5
    iterations: 20

  - scenario: get_api_inventory_category_1
    concurrency: 5
    iterations: 20

scenarios:
  post_put_delete_api_warehouse_category_inventory_product:
    script: post-put-delete-api-warehouse-category-inventory-product-test-plan.jmx

  get_api_inventory:
    script: get-api-inventory-test-plan.jmx

  get_api_warehouse:
    script: get-api-warehouse-test-plan.jmx

  get_api_warehouse_1:
    script: get-api-warehouse-1-test-plan.jmx

  get_api_category:
    script: get-api-category-test-plan.jmx

  get_api_category_1:
    script: get-api-category-1-test-plan.jmx

  get_api_product_detailed_categoryid_1:
    script: get-api-product-detailed-categoryid-1-test-plan.jmx

  get_api_inventory_category_1:
    script: get-api-inventory-category-1-test-plan.jmx

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml