stepping.yml
version: 1.0

# 100 requests
execution:
  - scenario: get_api_inventory
    concurrency: 5
    iterations: 20

  - scenario: get_api_product_detailed_categoryid_1
    concurrency: 5
    iterations: 20

scenarios:
  get_api_inventory:
    script: get-api-inventory-test-plan.jmx

  get_api_product_detailed_categoryid_1:
    script: get-api-product-detailed-categoryid-1-test-plan.jmx

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml