stepping.yml
version: 1.0

# 100 requests
# will apply to all scenarios
default-execution:
  concurrency: 2
  ramp-up: 5s
  hold-for: 10s

execution:
  - scenario: inventory_api_test
  - scenario: dashboard_visit_test

scenarios:
  inventory_api_test:
    script: dashboard-inventory-api-test.jmx

  dashboard_visit_test:
    script: dashboard-page-visit-test.jmx

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml