stepping.yml
version: 1.0

# 100 requests
execution:
  - scenario: inventory_api_test
    concurrency: 2
    ramp-up: 5s
    hold-for: 10s

  - scenario: dashboard_visit_test
    concurrency: 2
    ramp-up: 5s
    hold-for: 10s

scenarios:
  inventory_api_test:
    script: dashboard-inventory-api-test.jmx

  dashboard_visit_test:
    script: dashboard-page-visit-test.jmx

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml